Revit 2026 API

# FilterNumericRuleEvaluator Properties

---

The FilterNumericRuleEvaluator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FilterNumericRuleEvaluator Class

Autodesk.Revit.DB Namespace